const Questions = {
  general: {
    Q1: 'ถ้าน้องถูกจารึกไว้ในประวัติศาสตร์ว่าเป็นบุคคลสำคัญ น้องคิดว่าตัวเองควรถูกจารึกไว้ในด้านใด ด้วยเหตุผลอะไร ?',
    Q2:
      'ถ้าน้องต้องการแก้ปัญหาเรื่องฝุ่น PM2.5 น้องคิดว่าการแก้ปัญหาต้องเริ่มที่ภาคประชาชนหรือภาครัฐ เพราะเหตุผลอะไร และน้องจะเสนอแนวทางการแก้ปัญหานี้อย่างไร ?',
  },
  creative: {
    Q1:
      'ปัจจุบันโลกของเรากำลังเผชิญกับปัญหาในหลาย ๆ ด้าน ไม่ว่าจะเป็น ภัยพิบัติธรรมชาติ เศรษฐกิจ หรือด้านอื่น ๆ อีกมากมาย น้องมีวิธีการที่จะส่งเสริมให้ผู้คนตระหนักถึงเรื่องเหล่านี้มากขึ้นได้อย่างไร ?',
    Q2:
      'ถ้าน้องเป็นนักวิทยาศาสตร์ที่รู้วิธีการรักษาของ "ไวรัสโคโรนา" และเมื่อนำเสนอวิธีการรักษานี้ออกไป ประชาชนกลับมองว่าเป็นวิธีการที่ไม่น่าเชื่อถือ น้องจะมีวิธีการหรือไอเดียในการสร้างความน่าเชื่อถือได้อย่างไร ?',
  },
  designer: {
    Q1:
      'ให้น้องลองออกแบบโลโก้ค่าย YCC ขึ้นมาใหม่ในแบบของน้อง (สามารถถ่ายภาพวาดบนกระดาษ หรือ ออกแบบบนโปรแกรมต่าง ๆ ได้) พร้อมอธิบายแนวคิดในการออกแบบโลโก้นี้ โดยสามารถดาวน์โหลดไฟล์โลโก้ปัจจุบันได้ ที่นี่',
    Q2:
      'เคยรู้จักคำว่า Universal Design (ผลิตภัณฑ์ที่ใช้ได้กับทุกเพศทุกวัย) ไหม? ลองอธิบายความหมาย และยกตัวอย่างผลิตภัณฑ์ พร้อมอธิบายว่าทำไมมันจึงถูกออกแบบมาเช่นนี้ ในความคิดของตนเอง',
  },
  developer: {
    Q1:
      'น้องเห็นด้วยกับคำว่า "Artificial Intelligence (AI) ควรถูกพัฒนาไปอย่างไม่มีข้อจำกัด" หรือไม่ เพราะเหตุใด (สามารถอ้างอิงแหล่งที่มาของข้อความที่ยกมาได้) ?',
    Q2:
      'ลองเขียนโปรแกรมเพื่อแนะแนะนำบุคคลสำคัญที่น้องชื่นชอบคนใดก็ได้สั้น ๆ ในรูปแบบใดก็ได้ ไม่ว่าจะเป็นเว็บไซต์, โปรแกรม command line หรือรูปแบบอื่น ๆ ตามที่ต้องการ (ถ้าเป็นโค้ด HTML สามารถวางในช่องด้านล่างได้เลย หรือสามารถส่งโค้ดผ่าน GitHub, Gitlab, Gist หรือแพลตฟอร์มอื่น ๆ ด้วยการใส่ URL)',
  },
};

export default Questions;
